; domain
(define (domain blocks)

    (:requirements :strips :typing)

    (:types block)

    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block)
    )

    (:action pick-up
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x))
    )

    (:action put-down
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x))
    )

    (:action stack
        :parameters (?x - block ?y - block)
        :precondition (and (holding ?x) (clear ?y))
        :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y))
    )

    (:action unstack
        :parameters (?x - block ?y - block)
        :precondition (and (on ?x ?y) (clear ?x) (handempty))
        :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y)))
    )
)

; problem
(define (problem blocks-prob-6)
  (:domain blocks)

  (:objects
    b1 - block
    b2 - block
    b3 - block
    b4 - block
    b5 - block
    b6 - block
    b7 - block
    b8 - block
    b9 - block
    b10 - block
    b11 - block
    b12 - block
  )

  (:init
    (ontable b1)
    (on b9 b1)
    (on b8 b9)
    (on b6 b8)
    (on b2 b6)
    (on b12 b2)
    (ontable b7)
    (on b5 b7)
    (on b4 b5)
    (on b3 b4)
    (on b10 b3)
    (on b11 b10)
    (clear b12)
    (clear b11)
    (handempty)
  )

  (:goal (and
    (ontable b3)
    (on b12 b3)
    (ontable b11)
    (ontable b9)
    (ontable b10)
    (ontable b1)
    (ontable b7)
    (ontable b6)
    (ontable b2)
    (ontable b5)
    (ontable b4)
    (ontable b8)
  ))
)

; plan
1. (unstack b11 b10)
   deleted: (clear b11) (handempty) (on b11 b10)
   added: (holding b11) (clear b10)
   goals met: 2 of 12
2. (put-down b11)
   deleted: (holding b11)
   added: (clear b11) (handempty) (ontable b11)
   goals met: 3 of 12
3. (unstack b10 b3)
   deleted: (clear b10) (handempty) (on b10 b3)
   added: (holding b10) (clear b3)
   goals met: 3 of 12
4. (put-down b10)
   deleted: (holding b10)
   added: (clear b10) (handempty) (ontable b10)
   goals met: 4 of 12
5. (unstack b3 b4)
   deleted: (clear b3) (handempty) (on b3 b4)
   added: (holding b3) (clear b4)
   goals met: 4 of 12
6. (put-down b3)
   deleted: (holding b3)
   added: (clear b3) (handempty) (ontable b3)
   goals met: 5 of 12
7. (unstack b4 b5)
   deleted: (clear b4) (handempty) (on b4 b5)
   added: (holding b4) (clear b5)
   goals met: 5 of 12
8. (put-down b4)
   deleted: (holding b4)
   added: (clear b4) (handempty) (ontable b4)
   goals met: 6 of 12
9. (unstack b12 b2)
   deleted: (clear b12) (handempty) (on b12 b2)
   added: (holding b12) (clear b2)
   goals met: 6 of 12
10. (stack b12 b3)
   deleted: (holding b12) (clear b3)
   added: (clear b12) (handempty) (on b12 b3)
   goals met: 7 of 12
11. (unstack b2 b6)
   deleted: (clear b2) (handempty) (on b2 b6)
   added: (holding b2) (clear b6)
   goals met: 7 of 12
12. (put-down b2)
   deleted: (holding b2)
   added: (clear b2) (handempty) (ontable b2)
   goals met: 8 of 12
13. (unstack b5 b7)
   deleted: (clear b5) (handempty) (on b5 b7)
   added: (holding b5) (clear b7)
   goals met: 8 of 12
14. (put-down b5)
   deleted: (holding b5)
   added: (clear b5) (handempty) (ontable b5)
   goals met: 9 of 12
15. (unstack b6 b8)
   deleted: (clear b6) (handempty) (on b6 b8)
   added: (holding b6) (clear b8)
   goals met: 9 of 12
16. (put-down b6)
   deleted: (holding b6)
   added: (clear b6) (handempty) (ontable b6)
   goals met: 10 of 12
17. (unstack b8 b9)
   deleted: (clear b8) (handempty) (on b8 b9)
   added: (holding b8) (clear b9)
   goals met: 10 of 12
18. (put-down b8)
   deleted: (holding b8)
   added: (clear b8) (handempty) (ontable b8)
   goals met: 11 of 12
19. (unstack b9 b1)
   deleted: (clear b9) (handempty) (on b9 b1)
   added: (holding b9) (clear b1)
   goals met: 11 of 12
20. (put-down b9)
   deleted: (holding b9)
   added: (clear b9) (handempty) (ontable b9)
   goals met: 12 of 12
